# Данная строка
s = input()

# Вывод требуемой информации
print(s[2])                        # Третий символ
print(s[-2])                       # Предпоследний символ
print(s[:5])                       # Первые пять символов
print(s[:-2])                      # Вся строка, кроме последних двух символов
print(s[::2])                      # Символы с четными индексами
print(s[1::2])                     # Символы с нечетными индексами
print(s[::-1])                     # Символы в обратном порядке
print(s[::-2])                     # Символы через один в обратном порядке
print(len(s))                      # Длина строки
